; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star1 - direction
	Star2 - direction
	Star8 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation9 - direction
	Star5 - direction
	GroundStation12 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star7)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation12)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation9)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation11)
)
(:goal (and
	(pointing satellite1 GroundStation12)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 infrared1)
	(have_image Phenomenon17 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation12 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 groundstation12)
   goals met: 1 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
3. (calibrate satellite1 instrument2 groundstation12)
   added: (calibrated instrument2)
   goals met: 1 of 6
4. (turn_to satellite1 phenomenon16 groundstation12)
   deleted: (pointing satellite1 groundstation12)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon16 instrument2 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon14 instrument2 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 6
8. (turn_to satellite1 phenomenon17 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 6
9. (take_image satellite1 phenomenon17 instrument2 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite1 planet13 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet13)
   goals met: 3 of 6
11. (take_image satellite1 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 6
12. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 4 of 6
13. (take_image satellite1 planet15 instrument2 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 5 of 6
14. (turn_to satellite1 groundstation12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation12)
   goals met: 6 of 6
